Tekla Open API Reference for Tekla Structures 2025
IEvents.DrawingDeleted Event
 The DrawingDeleted event is raised when a drawing has been deleted.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.DrawingDeletedDelegate DrawingDeleted
Event DrawingDeleted As Events.DrawingDeletedDelegate
Value
Type: Tekla.Structures.Drawing.Events.DrawingDeletedDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Drawing Namespace